---
kind: type
id: T:Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored
source: html/2b52610e-fbc2-d983-d28c-6fd05a7a215e.htm
---
# Autodesk.Revit.DB.DirectContext3D.VertexStreamPositionNormalColored

A stream that can be used to write vertices of type VertexPositionNormalColored
 into a buffer (see VertexBuffer ).

## Syntax (C#)
```csharp
public class VertexStreamPositionNormalColored : VertexStream
```